zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_MSCM.h
/*! @name XN_CTRL - Memory Execution Control */
/*! @{ */

#define MSCM_XN_CTRL_SRAM0_XN_MASK               (0x1U)
#define MSCM_XN_CTRL_SRAM0_XN_SHIFT              (0U)
#define MSCM_XN_CTRL_SRAM0_XN_WIDTH              (1U)
#define MSCM_XN_CTRL_SRAM0_XN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_SRAM0_XN_SHIFT)) & MSCM_XN_CTRL_SRAM0_XN_MASK)

#define MSCM_XN_CTRL_SRAM1_XN_MASK               (0x2U)
#define MSCM_XN_CTRL_SRAM1_XN_SHIFT              (1U)
#define MSCM_XN_CTRL_SRAM1_XN_WIDTH              (1U)
#define MSCM_XN_CTRL_SRAM1_XN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_SRAM1_XN_SHIFT)) & MSCM_XN_CTRL_SRAM1_XN_MASK)

#define MSCM_XN_CTRL_ITCM0_XN_MASK               (0x100U)
#define MSCM_XN_CTRL_ITCM0_XN_SHIFT              (8U)
#define MSCM_XN_CTRL_ITCM0_XN_WIDTH              (1U)
#define MSCM_XN_CTRL_ITCM0_XN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_ITCM0_XN_SHIFT)) & MSCM_XN_CTRL_ITCM0_XN_MASK)

#define MSCM_XN_CTRL_ITCM1_XN_MASK               (0x200U)
#define MSCM_XN_CTRL_ITCM1_XN_SHIFT              (9U)
#define MSCM_XN_CTRL_ITCM1_XN_WIDTH              (1U)
#define MSCM_XN_CTRL_ITCM1_XN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_ITCM1_XN_SHIFT)) & MSCM_XN_CTRL_ITCM1_XN_MASK)

#define MSCM_XN_CTRL_ITCM0_BK_XN_MASK            (0x1000U)
#define MSCM_XN_CTRL_ITCM0_BK_XN_SHIFT           (12U)
#define MSCM_XN_CTRL_ITCM0_BK_XN_WIDTH           (1U)
#define MSCM_XN_CTRL_ITCM0_BK_XN(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_ITCM0_BK_XN_SHIFT)) & MSCM_XN_CTRL_ITCM0_BK_XN_MASK)

#define MSCM_XN_CTRL_ITCM1_BK_XN_MASK            (0x2000U)
#define MSCM_XN_CTRL_ITCM1_BK_XN_SHIFT           (13U)
#define MSCM_XN_CTRL_ITCM1_BK_XN_WIDTH           (1U)
#define MSCM_XN_CTRL_ITCM1_BK_XN(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_ITCM1_BK_XN_SHIFT)) & MSCM_XN_CTRL_ITCM1_BK_XN_MASK)

#define MSCM_XN_CTRL_DTCM0_XN_MASK               (0x10000U)
#define MSCM_XN_CTRL_DTCM0_XN_SHIFT              (16U)
#define MSCM_XN_CTRL_DTCM0_XN_WIDTH              (1U)
#define MSCM_XN_CTRL_DTCM0_XN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_DTCM0_XN_SHIFT)) & MSCM_XN_CTRL_DTCM0_XN_MASK)

#define MSCM_XN_CTRL_DTCM1_XN_MASK               (0x20000U)
#define MSCM_XN_CTRL_DTCM1_XN_SHIFT              (17U)
#define MSCM_XN_CTRL_DTCM1_XN_WIDTH              (1U)
#define MSCM_XN_CTRL_DTCM1_XN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_DTCM1_XN_SHIFT)) & MSCM_XN_CTRL_DTCM1_XN_MASK)

#define MSCM_XN_CTRL_DTCM0_BK_XN_MASK            (0x100000U)
#define MSCM_XN_CTRL_DTCM0_BK_XN_SHIFT           (20U)
#define MSCM_XN_CTRL_DTCM0_BK_XN_WIDTH           (1U)
#define MSCM_XN_CTRL_DTCM0_BK_XN(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_DTCM0_BK_XN_SHIFT)) & MSCM_XN_CTRL_DTCM0_BK_XN_MASK)

#define MSCM_XN_CTRL_DTCM1_BK_XN_MASK            (0x200000U)
#define MSCM_XN_CTRL_DTCM1_BK_XN_SHIFT           (21U)
#define MSCM_XN_CTRL_DTCM1_BK_XN_WIDTH           (1U)
#define MSCM_XN_CTRL_DTCM1_BK_XN(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_DTCM1_BK_XN_SHIFT)) & MSCM_XN_CTRL_DTCM1_BK_XN_MASK)

#define MSCM_XN_CTRL_SLK_MASK                    (0x40000000U)
#define MSCM_XN_CTRL_SLK_SHIFT                   (30U)
#define MSCM_XN_CTRL_SLK_WIDTH                   (1U)
#define MSCM_XN_CTRL_SLK(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_SLK_SHIFT)) & MSCM_XN_CTRL_SLK_MASK)

#define MSCM_XN_CTRL_HLK_MASK                    (0x80000000U)
#define MSCM_XN_CTRL_HLK_SHIFT                   (31U)
#define MSCM_XN_CTRL_HLK_WIDTH                   (1U)
#define MSCM_XN_CTRL_HLK(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_HLK_SHIFT)) & MSCM_XN_CTRL_HLK_MASK)
/*! @} */

/*! @name ENEDC - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC_EN_RD_CM7_0_AHBM_MASK         (0x1U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBM_SHIFT        (0U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBM_WIDTH        (1U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_0_AHBM_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_0_AHBM_MASK)

#define MSCM_ENEDC_EN_RD_CM7_0_AHBP_MASK         (0x2U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBP_SHIFT        (1U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBP_WIDTH        (1U)
#define MSCM_ENEDC_EN_RD_CM7_0_AHBP(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_0_AHBP_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_0_AHBP_MASK)

#define MSCM_ENEDC_EN_RD_EDMA_MASK               (0x4U)
#define MSCM_ENEDC_EN_RD_EDMA_SHIFT              (2U)
#define MSCM_ENEDC_EN_RD_EDMA_WIDTH              (1U)
#define MSCM_ENEDC_EN_RD_EDMA(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_EDMA_SHIFT)) & MSCM_ENEDC_EN_RD_EDMA_MASK)

#define MSCM_ENEDC_EN_RD_HSE_MASK                (0x10U)
#define MSCM_ENEDC_EN_RD_HSE_SHIFT               (4U)
#define MSCM_ENEDC_EN_RD_HSE_WIDTH               (1U)
#define MSCM_ENEDC_EN_RD_HSE(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_HSE_SHIFT)) & MSCM_ENEDC_EN_RD_HSE_MASK)

#define MSCM_ENEDC_EN_RD_EMAC_MASK               (0x20U)
#define MSCM_ENEDC_EN_RD_EMAC_SHIFT              (5U)
#define MSCM_ENEDC_EN_RD_EMAC_WIDTH              (1U)
#define MSCM_ENEDC_EN_RD_EMAC(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_EMAC_SHIFT)) & MSCM_ENEDC_EN_RD_EMAC_MASK)

#define MSCM_ENEDC_EN_RD_CM7_1_AHBM_MASK         (0x40U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBM_SHIFT        (6U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBM_WIDTH        (1U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_1_AHBM_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_1_AHBM_MASK)

#define MSCM_ENEDC_EN_RD_CM7_1_AHBP_MASK         (0x80U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBP_SHIFT        (7U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBP_WIDTH        (1U)
#define MSCM_ENEDC_EN_RD_CM7_1_AHBP(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_CM7_1_AHBP_SHIFT)) & MSCM_ENEDC_EN_RD_CM7_1_AHBP_MASK)

#define MSCM_ENEDC_EN_RD_TCM_MASK                (0x100U)
#define MSCM_ENEDC_EN_RD_TCM_SHIFT               (8U)
#define MSCM_ENEDC_EN_RD_TCM_WIDTH               (1U)
#define MSCM_ENEDC_EN_RD_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_RD_TCM_SHIFT)) & MSCM_ENEDC_EN_RD_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0_MASK      (0x200U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0_SHIFT     (9U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0_WIDTH     (1U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT0(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PFLASH_PORT0_SHIFT)) & MSCM_ENEDC_EN_ADD_PFLASH_PORT0_MASK)

#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1_MASK      (0x400U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1_SHIFT     (10U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1_WIDTH     (1U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT1(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PFLASH_PORT1_SHIFT)) & MSCM_ENEDC_EN_ADD_PFLASH_PORT1_MASK)

