zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_MSCM.h
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2_MASK      (0x800U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2_SHIFT     (11U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2_WIDTH     (1U)
#define MSCM_ENEDC_EN_ADD_PFLASH_PORT2(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PFLASH_PORT2_SHIFT)) & MSCM_ENEDC_EN_ADD_PFLASH_PORT2_MASK)

#define MSCM_ENEDC_EN_WR_PRAM0_MASK              (0x1000U)
#define MSCM_ENEDC_EN_WR_PRAM0_SHIFT             (12U)
#define MSCM_ENEDC_EN_WR_PRAM0_WIDTH             (1U)
#define MSCM_ENEDC_EN_WR_PRAM0(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_PRAM0_SHIFT)) & MSCM_ENEDC_EN_WR_PRAM0_MASK)

#define MSCM_ENEDC_EN_ADD_PRAM0_MASK             (0x2000U)
#define MSCM_ENEDC_EN_ADD_PRAM0_SHIFT            (13U)
#define MSCM_ENEDC_EN_ADD_PRAM0_WIDTH            (1U)
#define MSCM_ENEDC_EN_ADD_PRAM0(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PRAM0_SHIFT)) & MSCM_ENEDC_EN_ADD_PRAM0_MASK)

#define MSCM_ENEDC_EN_WR_PRAM1_MASK              (0x4000U)
#define MSCM_ENEDC_EN_WR_PRAM1_SHIFT             (14U)
#define MSCM_ENEDC_EN_WR_PRAM1_WIDTH             (1U)
#define MSCM_ENEDC_EN_WR_PRAM1(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_PRAM1_SHIFT)) & MSCM_ENEDC_EN_WR_PRAM1_MASK)

#define MSCM_ENEDC_EN_ADD_PRAM1_MASK             (0x8000U)
#define MSCM_ENEDC_EN_ADD_PRAM1_SHIFT            (15U)
#define MSCM_ENEDC_EN_ADD_PRAM1_WIDTH            (1U)
#define MSCM_ENEDC_EN_ADD_PRAM1(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_PRAM1_SHIFT)) & MSCM_ENEDC_EN_ADD_PRAM1_MASK)

#define MSCM_ENEDC_EN_WR_TCM_MASK                (0x10000U)
#define MSCM_ENEDC_EN_WR_TCM_SHIFT               (16U)
#define MSCM_ENEDC_EN_WR_TCM_WIDTH               (1U)
#define MSCM_ENEDC_EN_WR_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_TCM_SHIFT)) & MSCM_ENEDC_EN_WR_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_TCM_MASK               (0x20000U)
#define MSCM_ENEDC_EN_ADD_TCM_SHIFT              (17U)
#define MSCM_ENEDC_EN_ADD_TCM_WIDTH              (1U)
#define MSCM_ENEDC_EN_ADD_TCM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_TCM_SHIFT)) & MSCM_ENEDC_EN_ADD_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_QSPI_MASK              (0x80000U)
#define MSCM_ENEDC_EN_ADD_QSPI_SHIFT             (19U)
#define MSCM_ENEDC_EN_ADD_QSPI_WIDTH             (1U)
#define MSCM_ENEDC_EN_ADD_QSPI(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_QSPI_SHIFT)) & MSCM_ENEDC_EN_ADD_QSPI_MASK)

#define MSCM_ENEDC_EN_WR_AIPS0_MASK              (0x100000U)
#define MSCM_ENEDC_EN_WR_AIPS0_SHIFT             (20U)
#define MSCM_ENEDC_EN_WR_AIPS0_WIDTH             (1U)
#define MSCM_ENEDC_EN_WR_AIPS0(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_AIPS0_SHIFT)) & MSCM_ENEDC_EN_WR_AIPS0_MASK)

#define MSCM_ENEDC_EN_ADD_AIPS0_MASK             (0x200000U)
#define MSCM_ENEDC_EN_ADD_AIPS0_SHIFT            (21U)
#define MSCM_ENEDC_EN_ADD_AIPS0_WIDTH            (1U)
#define MSCM_ENEDC_EN_ADD_AIPS0(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_AIPS0_SHIFT)) & MSCM_ENEDC_EN_ADD_AIPS0_MASK)

#define MSCM_ENEDC_EN_WR_AIPS1_MASK              (0x400000U)
#define MSCM_ENEDC_EN_WR_AIPS1_SHIFT             (22U)
#define MSCM_ENEDC_EN_WR_AIPS1_WIDTH             (1U)
#define MSCM_ENEDC_EN_WR_AIPS1(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_AIPS1_SHIFT)) & MSCM_ENEDC_EN_WR_AIPS1_MASK)

#define MSCM_ENEDC_EN_ADD_AIPS1_MASK             (0x800000U)
#define MSCM_ENEDC_EN_ADD_AIPS1_SHIFT            (23U)
#define MSCM_ENEDC_EN_ADD_AIPS1_WIDTH            (1U)
#define MSCM_ENEDC_EN_ADD_AIPS1(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_AIPS1_SHIFT)) & MSCM_ENEDC_EN_ADD_AIPS1_MASK)

#define MSCM_ENEDC_EN_WR_AIPS2_MASK              (0x1000000U)
#define MSCM_ENEDC_EN_WR_AIPS2_SHIFT             (24U)
#define MSCM_ENEDC_EN_WR_AIPS2_WIDTH             (1U)
#define MSCM_ENEDC_EN_WR_AIPS2(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_AIPS2_SHIFT)) & MSCM_ENEDC_EN_WR_AIPS2_MASK)

#define MSCM_ENEDC_EN_ADD_AIPS2_MASK             (0x2000000U)
#define MSCM_ENEDC_EN_ADD_AIPS2_SHIFT            (25U)
#define MSCM_ENEDC_EN_ADD_AIPS2_WIDTH            (1U)
#define MSCM_ENEDC_EN_ADD_AIPS2(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_AIPS2_SHIFT)) & MSCM_ENEDC_EN_ADD_AIPS2_MASK)

#define MSCM_ENEDC_EN_WR_CM7_0_TCM_MASK          (0x4000000U)
#define MSCM_ENEDC_EN_WR_CM7_0_TCM_SHIFT         (26U)
#define MSCM_ENEDC_EN_WR_CM7_0_TCM_WIDTH         (1U)
#define MSCM_ENEDC_EN_WR_CM7_0_TCM(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_CM7_0_TCM_SHIFT)) & MSCM_ENEDC_EN_WR_CM7_0_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_CM7_0_TCM_MASK         (0x8000000U)
#define MSCM_ENEDC_EN_ADD_CM7_0_TCM_SHIFT        (27U)
#define MSCM_ENEDC_EN_ADD_CM7_0_TCM_WIDTH        (1U)
#define MSCM_ENEDC_EN_ADD_CM7_0_TCM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_CM7_0_TCM_SHIFT)) & MSCM_ENEDC_EN_ADD_CM7_0_TCM_MASK)

#define MSCM_ENEDC_EN_WR_CM7_1_TCM_MASK          (0x10000000U)
#define MSCM_ENEDC_EN_WR_CM7_1_TCM_SHIFT         (28U)
#define MSCM_ENEDC_EN_WR_CM7_1_TCM_WIDTH         (1U)
#define MSCM_ENEDC_EN_WR_CM7_1_TCM(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_WR_CM7_1_TCM_SHIFT)) & MSCM_ENEDC_EN_WR_CM7_1_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_CM7_1_TCM_MASK         (0x20000000U)
#define MSCM_ENEDC_EN_ADD_CM7_1_TCM_SHIFT        (29U)
#define MSCM_ENEDC_EN_ADD_CM7_1_TCM_WIDTH        (1U)
#define MSCM_ENEDC_EN_ADD_CM7_1_TCM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_CM7_1_TCM_SHIFT)) & MSCM_ENEDC_EN_ADD_CM7_1_TCM_MASK)

#define MSCM_ENEDC_EN_ADD_DMA_S0_MASK            (0x40000000U)
#define MSCM_ENEDC_EN_ADD_DMA_S0_SHIFT           (30U)
#define MSCM_ENEDC_EN_ADD_DMA_S0_WIDTH           (1U)
#define MSCM_ENEDC_EN_ADD_DMA_S0(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_DMA_S0_SHIFT)) & MSCM_ENEDC_EN_ADD_DMA_S0_MASK)

#define MSCM_ENEDC_EN_ADD_DMA_S1_MASK            (0x80000000U)
#define MSCM_ENEDC_EN_ADD_DMA_S1_SHIFT           (31U)
#define MSCM_ENEDC_EN_ADD_DMA_S1_WIDTH           (1U)
#define MSCM_ENEDC_EN_ADD_DMA_S1(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EN_ADD_DMA_S1_SHIFT)) & MSCM_ENEDC_EN_ADD_DMA_S1_MASK)
/*! @} */

/*! @name IAHBCFGREG - AHB Gasket Configuration */
/*! @{ */

#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_MASK     (0x1U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_SHIFT    (0U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_WIDTH    (1U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK (0x10U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT (4U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK (0x100U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT (8U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK      (0x1000U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT     (12U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK)

